# -*- coding: utf-8 -*-
x = float(input("Число x: "))
y = float(input("Число y: "))



if x == 0 and y == 0:
    print("Точка розташована в початку координат.")
elif x == 0:
    print("Точка розташована на осі Y.")
elif y == 0:
    print("Точка розташована на осі X.")
else:
    if x > 0 and y > 0:
        print("Точка розташована в першому квадранті.")
    elif x < 0 and y > 0:
        print("Точка розташована в другому квадранті.")
    elif x < 0 and y < 0:
        print("Точка розташована в третьому квадранті.")
    else:
        print("Точка розташована в четвертому квадранті.")